# -*- fill-column: 76; -*-
#+Title: Benchmark page_pool on AMD CPU
#+OPTIONS: ^:nil

* Document index (autogenerated)  :toc:
- [[#intel-results][Intel results]]
- [[#amd-results][AMD results]]
  - [[#amd-cpu---devel-kernel-pp01-dma-fix-v7][AMD CPU - devel kernel pp01-DMA-fix-v7]]

* Intel results

Intel CPU E5-1650 was benchmarked in [[file:page_pool07_bench_DMA_fix.org]].

Table summary for baseline, with bench_page_pool_simple results:

| Test name   | Cycles | Nanosec |
| (tasklet_*) |        |         |
|-------------+--------+---------|
| fast_path   |     19 |   5.399 |
| ptr_ring    |     54 |  15.090 |
| slow        |    238 |  66.134 |

* AMD results

CPU: AMD EPYC 9684X 96-Core Processor (CF Gen 12)

** AMD CPU - devel kernel pp01-DMA-fix-v7

Kernel: 6.13.0-rc6-pp01-DMA-fix-v7+

Compare table: Intel-baseline vs AMD-patched:

| Test name   | Cycles |     |      | Nanosec |         |        |      % |
| (tasklet_*) |  Intel | AMD | diff |   Intel |     AMD |   diff | change |
|-------------+--------+-----+------+---------+---------+--------+--------|
| fast_path   |     19 |  54 |   35 |   5.399 |  21.256 | 15.857 |  293.7 |
| ptr_ring    |     54 | 118 |   64 |  15.090 |  46.668 | 31.578 |  209.3 |
| slow        |    238 | 354 |  116 |  66.134 | 139.400 | 73.266 |  110.8 |
#+TBLFM: $4=$3-$2::$7=$6-$5::$8=(($7/$5)*100);%.1f

Raw data:
#+begin_example
 bench_page_pool_simple: Loaded
 time_bench: Type:for_loop Per elem: 1 cycles(tsc) 0.543 ns (step:0) - (measurement period time:0.054322042 sec time_interval:54322042) - (invoke count:100000000 tsc_interval:138312637)
 time_bench: Type:atomic_inc Per elem: 4 cycles(tsc) 1.732 ns (step:0) - (measurement period time:0.173226385 sec time_interval:173226385) - (invoke count:100000000 tsc_interval:441064065)
 time_bench: Type:lock Per elem: 37 cycles(tsc) 14.659 ns (step:0) - (measurement period time:0.146598674 sec time_interval:146598674) - (invoke count:10000000 tsc_interval:373264716)
 bench_page_pool_simple: time_bench_page_pool01_fast_path(): Cannot use page_pool fast-path
 time_bench: Type:no-softirq-page_pool01 Per elem: 53 cycles(tsc) 21.197 ns (step:0) - (measurement period time:0.211978152 sec time_interval:211978152) - (invoke count:10000000 tsc_interval:539731955)
 bench_page_pool_simple: time_bench_page_pool02_ptr_ring(): Cannot use page_pool fast-path
 time_bench: Type:no-softirq-page_pool02 Per elem: 89 cycles(tsc) 35.316 ns (step:0) - (measurement period time:0.353166180 sec time_interval:353166180) - (invoke count:10000000 tsc_interval:899222004)
 bench_page_pool_simple: time_bench_page_pool03_slow(): Cannot use page_pool fast-path
 time_bench: Type:no-softirq-page_pool03 Per elem: 317 cycles(tsc) 124.732 ns (step:0) - (measurement period time:1.247323944 sec time_interval:1247323944) - (invoke count:10000000 tsc_interval:3175903951)
 bench_page_pool_simple: pp_tasklet_handler(): in_serving_softirq fast-path
 bench_page_pool_simple: time_bench_page_pool01_fast_path(): in_serving_softirq fast-path
 time_bench: Type:tasklet_page_pool01_fast_path Per elem: 54 cycles(tsc) 21.256 ns (step:0) - (measurement period time:0.212565703 sec time_interval:212565703) - (invoke count:10000000 tsc_interval:541227708)
 bench_page_pool_simple: time_bench_page_pool02_ptr_ring(): in_serving_softirq fast-path
 time_bench: Type:tasklet_page_pool02_ptr_ring Per elem: 118 cycles(tsc) 46.668 ns (step:0) - (measurement period time:0.466686939 sec time_interval:466686939) - (invoke count:10000000 tsc_interval:1188265830)
 bench_page_pool_simple: time_bench_page_pool03_slow(): in_serving_softirq fast-path
 time_bench: Type:tasklet_page_pool03_slow Per elem: 354 cycles(tsc) 139.400 ns (step:0) - (measurement period time:1.394000956 sec time_interval:1394000956) - (invoke count:10000000 tsc_interval:3549369301)
#+end_example

